###############################################################################
# Created by write_sdc
# Sat Dec 31 04:36:31 2022
###############################################################################
current_design fpga_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name prog_clk -period 20.0000 [get_ports {prog_clk}]
set_clock_transition 0.1500 [get_clocks {prog_clk}]
set_clock_uncertainty 0.2500 prog_clk
set_propagated_clock [get_clocks {prog_clk}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {ccff_head}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {clk}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[0]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[10]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[11]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[12]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[13]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[14]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[15]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[16]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[17]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[18]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[19]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[1]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[20]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[21]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[22]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[23]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[24]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[25]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[26]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[27]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[28]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[29]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[2]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[30]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[31]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[32]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[33]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[34]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[35]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[36]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[37]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[38]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[39]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[3]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[40]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[41]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[42]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[43]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[44]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[45]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[46]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[47]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[48]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[49]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[4]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[50]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[51]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[52]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[53]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[54]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[55]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[56]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[57]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[58]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[59]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[5]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[60]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[61]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[62]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[63]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[6]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[7]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[8]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_in[9]}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {pReset}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {reset}]
set_input_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {set}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {ccff_tail}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[0]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[10]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[11]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[12]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[13]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[14]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[15]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[16]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[17]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[18]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[19]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[1]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[20]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[21]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[22]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[23]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[24]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[25]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[26]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[27]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[28]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[29]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[2]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[30]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[31]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[32]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[33]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[34]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[35]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[36]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[37]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[38]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[39]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[3]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[40]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[41]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[42]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[43]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[44]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[45]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[46]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[47]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[48]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[49]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[4]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[50]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[51]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[52]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[53]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[54]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[55]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[56]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[57]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[58]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[59]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[5]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[60]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[61]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[62]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[63]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[6]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[7]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[8]}]
set_output_delay 4.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {gfpga_pad_GPIO_PAD_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {ccff_tail}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[0]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[1]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[2]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[3]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[4]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[5]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[6]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[7]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[8]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[9]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[10]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[11]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[12]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[13]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[14]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[15]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[16]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[17]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[18]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[19]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[20]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[21]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[22]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[23]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[24]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[25]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[26]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[27]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[28]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[29]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[30]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[31]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[32]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[33]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[34]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[35]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[36]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[37]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[38]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[39]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[40]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[41]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[42]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[43]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[44]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[45]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[46]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[47]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[48]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[49]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[50]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[51]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[52]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[53]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[54]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[55]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[56]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[57]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[58]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[59]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[60]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[61]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[62]}]
set_load -pin_load 0.0334 [get_ports {gfpga_pad_GPIO_PAD_out[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ccff_head}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pReset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prog_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {set}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gfpga_pad_GPIO_PAD_in[63]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
